package Thesixth;

public class TwoDimensionalArray {


    /**
     * @ClassName ArrayDemo14
     * @Description 此类用于演示功能
     * @Author Shark
     * @DateTime 2022年02月19日 16时25分
     * @Version 1.0
     *
     * 二维数组:
     *      数组中的元素依然是数组
     *
     * 二维数组的声明:
     *      数据类型[][] 数组名;(推荐)
     *      数据类型 数组名[][];
     *      数据类型[] 数组名[];
     *
     * 二维数组的初始化:
     *      动态初始化
     *          格式1:初始化二维数组的同时,初始化里面每个一维数组
     *              数据类型[][] 数组名 = new 数据类型[x][y];
     *              x : 二维数组中含有多少个一维数组
     *              y : 每个一维数组中含有多少个元素
     *          格式2:初始化二维数组但不会初始化里面每个一维数组
     *              数据类型[][] 数组名 = new 数据类型[x][];
     *      静态初始化
     *          格式1:
     *              数据类型[][] 数组名 = new 数据类型[][]{new 数据类型[]{元素1,元素2,......,元素n},new 数据类型[]{元素1,元素2,......,元素n},......,new 数据类型[]{元素1,元素2,......,元素n}}
     *          格式2:
     *              数据类型[][] 数组名 = new 数据类型[][]{{元素1,元素2,......,元素n},{元素1,元素2,......,元素n},......,{元素1,元素2,......,元素n}}
     *          格式3:
     *              数据类型[][] 数组名 = {{元素1,元素2,......,元素n},{元素1,元素2,......,元素n},......,{元素1,元素2,......,元素n}}
     */
    /**
     * @ClassName ArrayDemo15
     * @Description 此类用于演示功能
     * @Author Shark
     * @DateTime 2022年02月19日 16时39分
     * @Version 1.0
     *
     * 二维数组元素的访问:索引
     *      格式:
     *          数组名[x][y]
     *          x:访问元素所在一维数组在二维数组中的索引是多少
     *          y:访问元素在一维数组中索引是多少
     */
}
